socialNetwork/jaeger_traces/limit_socnetapp_unique-id-service/traces_socnetapp_unique-id-service_0.4.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 5.159ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.970ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.821ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.929ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.109ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.931ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.928ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.933ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.68ms  755.85us   6.63ms   81.38%
    Req/Sec    25.51     48.90   200.00     75.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.53ms
 75.000%    4.98ms
 90.000%    5.53ms
 99.000%    6.63ms
 99.900%   10.34ms
 99.990%   25.28ms
 99.999%   25.28ms
100.000%   25.28ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.357     0.000000            1         1.00
       3.997     0.100000          390         1.11
       4.163     0.200000          784         1.25
       4.295     0.300000         1180         1.43
       4.415     0.400000         1570         1.67
       4.535     0.500000         1953         2.00
       4.603     0.550000         2149         2.22
       4.679     0.600000         2346         2.50
       4.775     0.650000         2542         2.86
       4.871     0.700000         2732         3.33
       4.983     0.750000         2927         4.00
       5.043     0.775000         3023         4.44
       5.123     0.800000         3122         5.00
       5.195     0.825000         3220         5.71
       5.283     0.850000         3317         6.67
       5.403     0.875000         3412         8.00
       5.479     0.887500         3465         8.89
       5.527     0.900000         3510        10.00
       5.615     0.912500         3560        11.43
       5.695     0.925000         3607        13.33
       5.795     0.937500         3656        16.00
       5.847     0.943750         3681        17.78
       5.899     0.950000         3705        20.00
       5.971     0.956250         3730        22.86
       6.071     0.962500         3753        26.67
       6.155     0.968750         3779        32.00
       6.211     0.971875         3791        35.56
       6.263     0.975000         3802        40.00
       6.327     0.978125         3814        45.71
       6.411     0.981250         3826        53.33
       6.487     0.984375         3839        64.00
       6.535     0.985938         3846        71.11
       6.575     0.987500         3851        80.00
       6.595     0.989062         3857        91.43
       6.679     0.990625         3863       106.67
       6.811     0.992188         3869       128.00
       6.855     0.992969         3872       142.22
       6.923     0.993750         3875       160.00
       6.979     0.994531         3878       182.86
       7.031     0.995313         3881       213.33
       7.103     0.996094         3884       256.00
       7.127     0.996484         3886       284.44
       7.163     0.996875         3887       320.00
       7.403     0.997266         3889       365.71
       7.459     0.997656         3890       426.67
       8.019     0.998047         3892       512.00
       8.615     0.998242         3893       568.89
       8.615     0.998437         3893       640.00
       9.415     0.998633         3894       731.43
      10.335     0.998828         3895       853.33
      12.207     0.999023         3897      1024.00
      12.207     0.999121         3897      1137.78
      12.207     0.999219         3897      1280.00
      12.207     0.999316         3897      1462.86
      12.207     0.999414         3897      1706.67
      15.039     0.999512         3898      2048.00
      15.039     0.999561         3898      2275.56
      15.039     0.999609         3898      2560.00
      15.039     0.999658         3898      2925.71
      15.039     0.999707         3898      3413.33
      25.279     0.999756         3899      4096.00
      25.279     1.000000         3899          inf
#[Mean    =        4.679, StdDeviation   =        0.756]
#[Max     =       25.264, Total count    =         3899]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5805 requests in 30.11s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9506
  Non-2xx or 3xx responses: 2
Requests/sec:    192.79  
Transfer/sec:     40.48KB