socialNetwork/jaeger_traces/limit_socnetapp_unique-id-service/traces_socnetapp_unique-id-service_0.6.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.823ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.648ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.657ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.664ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.634ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.822ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 5.236ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.659ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.37ms  567.78us   6.25ms   74.14%
    Req/Sec    25.57     49.65   200.00     76.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.26ms
 75.000%    4.64ms
 90.000%    5.11ms
 99.000%    6.25ms
 99.900%    7.33ms
 99.990%    8.89ms
 99.999%    8.89ms
100.000%    8.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.139     0.000000            1         1.00
       3.777     0.100000          391         1.11
       3.927     0.200000          781         1.25
       4.041     0.300000         1174         1.43
       4.151     0.400000         1561         1.67
       4.263     0.500000         1952         2.00
       4.335     0.550000         2143         2.22
       4.411     0.600000         2346         2.50
       4.483     0.650000         2532         2.86
       4.559     0.700000         2733         3.33
       4.643     0.750000         2926         4.00
       4.699     0.775000         3021         4.44
       4.763     0.800000         3119         5.00
       4.839     0.825000         3218         5.71
       4.911     0.850000         3314         6.67
       4.999     0.875000         3413         8.00
       5.035     0.887500         3456         8.89
       5.107     0.900000         3506        10.00
       5.179     0.912500         3554        11.43
       5.247     0.925000         3602        13.33
       5.339     0.937500         3651        16.00
       5.395     0.943750         3678        17.78
       5.439     0.950000         3701        20.00
       5.491     0.956250         3725        22.86
       5.571     0.962500         3749        26.67
       5.691     0.968750         3774        32.00
       5.743     0.971875         3787        35.56
       5.775     0.975000         3799        40.00
       5.811     0.978125         3809        45.71
       5.923     0.981250         3821        53.33
       5.995     0.984375         3834        64.00
       6.135     0.985938         3840        71.11
       6.183     0.987500         3846        80.00
       6.219     0.989062         3852        91.43
       6.291     0.990625         3858       106.67
       6.351     0.992188         3864       128.00
       6.375     0.992969         3867       142.22
       6.387     0.993750         3870       160.00
       6.419     0.994531         3873       182.86
       6.447     0.995313         3876       213.33
       6.555     0.996094         3879       256.00
       6.567     0.996484         3881       284.44
       6.619     0.996875         3882       320.00
       6.631     0.997266         3884       365.71
       6.691     0.997656         3885       426.67
       6.827     0.998047         3887       512.00
       6.879     0.998242         3888       568.89
       6.879     0.998437         3888       640.00
       7.275     0.998633         3889       731.43
       7.327     0.998828         3890       853.33
       7.339     0.999023         3891      1024.00
       7.339     0.999121         3891      1137.78
       7.339     0.999219         3891      1280.00
       8.279     0.999316         3892      1462.86
       8.279     0.999414         3892      1706.67
       8.287     0.999512         3893      2048.00
       8.287     0.999561         3893      2275.56
       8.287     0.999609         3893      2560.00
       8.287     0.999658         3893      2925.71
       8.287     0.999707         3893      3413.33
       8.887     0.999756         3894      4096.00
       8.887     1.000000         3894          inf
#[Mean    =        4.375, StdDeviation   =        0.568]
#[Max     =        8.880, Total count    =         3894]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5827 requests in 30.05s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9510
  Non-2xx or 3xx responses: 2
Requests/sec:    193.89  
Transfer/sec:     40.71KB